const poems = [
  {
    id: 1,
    title: "מה הזמן",
    content: "מִי אָמַר\n שֶׁהֶעָתִיד הוּא מָחָר?\n וְהַהוֹוֶה הוּא עַכְשָׁו?\n מִי אָמַר?\n שֶׁהָאֶתְמוֹל הוּא עָבַר?\n מִי אָמַר?\n אוּלַי הָרֶגַע הַבָּא\n הוּא עָתִיד\n וְהַהוֹוֶה נִשְׁאַר\n לְתָמִיד?\n מָתַי הוּא נִגְמַר,\n הַהוֹוֶה\n וְהוֹפֵךְ לֶעָבָר?\n \n מָתַי מַתְחִיל הֶעָתִיד\n וְנִגְמַר הַהוֹוֶה\n אוּלַי בְּרֶגַע הַזֶּה\n זֶה קוֹרֶה?\n\n\n וְאִם בִּכְלָל\n הַזְּמַן הוּא מֻגְדָּר,\n תַּגִּידוּ אַתֶּם\n מָה נִשְׁאַר."
  },
  {
    id: 2,
    title: "וכשעברו",
    content: "וּכְשֶׁעָבְרוּ עָלַי\nגַּלֶּיךָ\nוְגַם מִשְׁבָּרֶיךָ\nעָבַרְתִּי\n\nבָּאוּ אֵלַי\nכָּל הָרְגָעִים\nשֶׁאָחַזְתָּ בִּי\nוְלֹא נָפַלְתִּי\nמִתְּהוֹם\nאֶל תְּהוֹם\nגָּבַרְתִּי\n\nנִשְׁאַרְתִּי\nלֹא נִשְׁבַּרְתִּי\n\nוְהִנֵּה,\nאֲנִי כָּאן\nאוֹמֶרֶת לְךָ\nמוּל כָּל\nהַחֲסָדִים-\n\nקָטֹנְתִּי\nבּוֹרְאִי,\nוְזוֹ הָאֱמֶת",
  },
  {
    id: 3,
    title: "אלול",
    content: "מָה זֶה אֱלוּל בִּשְׁבִילְךָ?\n \nמָה שֶׁהָיָה,\nאוֹ מָה שֶׁיִּהְיֶה?\n זֶה מְשַׁנֶּה?\n הָעִקָּר\n מָה שֶׁעָבַר\n מָה שֶׁעוֹבֵר\n וּמָה שֶׁאַתְּ עוֹשָׂה\n עַכְשָׁו\n תִּסְתַּכְּלִי בַּמַּרְאָה\n אֵיךְ אַתְּ נִרְאֵית\n אוּלַי קְצָת שׁוֹנָה\n בְּכָל זֹאת\n עָבְרָה שָׁנָה"
  },
  {
    id: 4,
    title: "אולי",
    content: "אַתֶּם\n כָּל הַיּוֹם\n מְתַכְנְנִים\n תָּכְנִיּוֹת\n חוֹגְגִים\n יוֹצְאִים לִקְנִיּוֹת\n הוֹלְכִים\n חוֹזְרִים\n נָחִים-\n בְּשָׁעוֹת פְּנוּיוֹת\n רָצִים\n עִם נַגָּן\n וְאָזְנִיּוֹת\n מְבַלִּים\n אוֹכְלִים\n בַּחֲנוּיוֹת\n יוֹשְׁבִים\n בַּחֲתֻנּוֹת\n מַשְׁוִים\n מְחִירֵי מוֹנִיּוֹת\n\n לָכֵן,\n יֵשׁ לִי חֲלוֹם\n אוּלַי\n פַּעַם אַחַת\n תָּבוֹאוּ\n אֵלַי\n תַּגִּידוּ שָׁלוֹם"
  },
  {
    id: 5,
    title: "שבט",
    content: "בַּכְּבִישׁ אָרֹךְ וַאֲפֹר\n עוֹמְדִים עֵצִים\n עֲרוּמִים\n עָפִים עֲנָפִים\n בָּרוּחַ\n נִרְטָבִים\n בַּגֶּשֶׁם\n\n וּבַבֹּקֶר אֶחָד\n זוֹרַחַת\n שֶׁמֶשׁ שֶׁל שֵׁבֶט\n מלְאָךְ\n פּוֹקד עֲלֵיהֶם\n לִגְדֹּל\n וְהֵם מְצַיְּתִים\n מְנִצִּים\n מִתְכַּסִּים בִּפְרָחִים\n קְטַנְטַנִּים\n מְבַשְּׂרִים.\n"
  },
  {
    id: 6,
    title: "צנצנת",
    content: "יש לי מדף.\n ואני מסדרת עליו\n המון צנצנות קטנות.\n\n בתוך הצנצנות אני אוגרת\n מחשבות\n אהבות\n רגשות\n חלומות\n סיפורים\n הגיגים\n מחמאות\n ומילים\n טובות\n וחסדים.\n\n זה המדף שלי\n ואני אוהבת להביט בו,\n כמה שהוא צבעוני ויפה\n ואיך מתמלאות הצנצנות\n לאט לאט.\n\n אולי,\n יום אחד\n אני אפתח לי צנצנת\n ועוד אחת\n ועוד אחת\n ובעצם את כולן,\n ואשפוך\n לתוך צנצנת ענקית.\n\n אז,\n אני אדע\n שזאת אני.\n וכמה שאני יפה.\n"
  },
  {
    id: 6,
    title: "גיל",
    content: "זה נכון\n שאנחנו רוצים\n להשאר צעירים\n לנצח\n עם פנים חלקות\n ובלי דאגות\n של קיום.\n\n אבל\n הם כן מתקדמים\n החיים ואנחנו,\n והקמטים\n הם בכלל\n קישוטים."
  },
  {
    id: 7,
    title: "פתאום",
    content: "יוֹם אֶחָד הוּא יָבוֹא\n יוֹם אֶחָד הוּא יַגִּיעַ\nפִּתְאוֹם זֶה יִקְרֶה\n תָּבוֹא גְּאֻלָּה\n עִם מִלִּים שֶׁל תְּפִלָּה\nשְׁלֵמָה וְאוֹהֶבֶת\n מְלֵאָה בְּכָל טוּב\n תַּאֲמִינִי שֶׁהִיא שֶׁלְּךָ\n שֶׁהִיא תֵּכֶף תָּבוֹא\n בְּרֶגַע אֶחָד\n יָבוֹא הָאוֹר"
  },
  {
    id: 8,
    title: "יצמח",
    content: "רַק רָצִיתִי\n לָתֵת לָךְ\n פֶּרַח\n שֶׁקָּטַפְתִּי\n\n  לְהַזְכִּיר לְךָ\n שֶׁהַקַּרְקַע\n עֲדַיִן כָּאן\n יַצִּיבָה\n\n חֲזָקָה\n כְּמוֹ תָּמִיד\n מַחְבִּיאָה שָׁרָשִׁים\n עֲמֻקִּים\n\n שֶׁהִיא יְרֻקָּה\n וְשׁוֹפַעַת\n וּמַצְמִיחָה\n גַּם פְּרָחִים\n\n אַל תִּבְכִּי\n יוֹם אֶחָד\n יִצְמַח בָּהּ\n גַּם עֵץ "
  },
  {
    id: 9,
    title: "שבט",
    content: "הִבִּיט הָאִילָן\n מִמְּרוֹם הַצַּמֶּרֶת\n בְּמִישֶׁהִי אַחַת\n שְׁפוּפָה, מְקֻמֶּרֶת\n\n נָעוּ עָלָיו בְּאִוְשָׁה\n קוּמִי בִּתִּי\n מִמַּעֲמַקֵּי הַטֵּבֵת,\n תָּבוֹא גְּאֻלָּה בְּקָרוֹב\n אֲנִי אֲחַכֶּה,\n\n שֶׁתְּבַשְּׂרִי\n בַּת\n טוֹב."
  },
  {
    id: 10,
    title: "לעולם",
    content: "אֲנִי רוֹצָה לַעֲמֹד עַל צוּק גָּבוֹהַּ\n  אֲנִי רוֹצָה לִצְעֹק מִשָּׁם.\n\n אֲנִי רוֹצָה לְהַגִּיד לָעוֹלָם\n  אֶת כָּל מָה שֶׁלֹּא אַגִּיד לְעוֹלָם."
  },
  {
    id: 11,
    title: "בחירה",
    content: "אֲנִי אַפְסִיק\n לִתְלוֹת תִּקְווֹת\n עַל חֶבֶל\n  \nאֲנִי אַפְסִיק\n לְמַלֵּא צִפִּיּוֹת\n בְּנוֹצוֹת\n\n אֲנִי אֶנְעַץ\n מְחָטִים\n בִּבְלוֹנֵי דִּמְיוֹנוֹת\n\n אֶצְעַד\n מַעֲדַנּוֹת\n עַל קִרְעֵי אַכְזָבוֹת\n\n אַבִּיט\n בַּאֲדִישׁוּת\n עַל פִּסּוֹת יֵאוּשׁ\n\n אֲנִי אַתְחִיל\n בֶּאֱמֶת\n לֶאֱהֹב\n אֶת עַצְמִי\n וְאֶת הָרֶגַע הַזֶּה."
  },
  {
    id: 12,
    title: "קליפות",
    content: "בַּצָּהֳרַיִם\n פִּלַּחְתִּי לִי תַּפּוּז כַּתֹּם\n כָּכָה\n בַּיָּדַיִם\n\n בָּעֶרֶב,\n סָחַטְתִּי לִימוֹן\n עַל דָּג\n בְּלִי לִשְׁטֹף\nבְּלִי סַבּוֹן\n\n בַּלַּיְלָה\n חָפַנְתִּי קְלֵמֶנְטִינָה\n קְטַנָּה וַעֲסִיסִית\n קִלַּפְתִּי\n בְּלִי כְּפָפָה\n בְּלִי שַׂקִּית\n\n שָׁאַפְתִּי לְקִרְבִּי\n אֶת הָרֵיחַ שֶׁדָּבַק\n בְּכַפּוֹת יָדַי\n רֵיחַ הֲדָרִים\n מְשַׁכֵּר\n מְתַקְתַּק\n\n\n וּפִתְאוֹם\n גִּלִּיתִי שֶׁזָּקַנְתִּי\n וְזֶה הָיָה\n יָפֶה כָּל כָּךְ"
  }

];

const getAllPoems = () => {
  return poems;
};

const getPoemById = (id) => {
  return poems.find(poem => poem.id === id);
};

export { poems, getAllPoems, getPoemById };
